// =========== 전개구문 ===========
// 전개구문 객체도 가능

const 위니브1 = { 개리: 1, 빙키: 2 };
const 위니브2 = { 라이캣: 3 };
const 위니브3 = { ...위니브1, ...위니브2 };

console.log(위니브3);

const 위니브임직원 = {
  개리: '재직중',
  빙키: '재직중',
  라이켓: '재직중',
  뮤라: '재직중',
  해골왕: '재직중',
};

// 객체 복사
const 위니브임직원2 = {
  ...위니브임직원,
};

// 객체 속성값 변경(update)
const 위니브임직원3 = {
  ...위니브임직원,
  라이켓: '휴가',
  해골왕: '퇴사',
};

// 객체의 [[키, 밸류], [키, 밸류], ...] 배열로 리턴
Object.entries(위니브임직원);

// =========== 구조분해할당 ===========

for (const [i, j] of [
  [1, 2],
  [3, 4],
  [5, 6],
]) {
  console.log(i, j);
}

for (const [i, j] of Object.entries(위니브임직원)) {
  console.log(i, j);
}

let [a, b] = [10, 20];
let [one1, two1, three1] = '010-5044-2903'.split('-');
let [one2, two2, ...three2] = '010-5044-2903-123-123'.split('-');
